# SQL II: Grouping and Joining

_June 29, 2020_

Agenda:
- Practice with Grouping in SQLite
- Practice with different types of Joins in SQLite

<img src = "https://media.giphy.com/media/3oKIPnAiaMCws8nOsE/giphy.gif">

In [2]:
import sqlite3
import pandas as pd
import seaborn as sns
import numpy as np

## Part I. Grouping
Just like pandas, Sql support different types of grouping statements for performing aggregate functions and allow us to calculate various statistics for data.

Syntax:
`SELECT * FROM tables GROUP BY column`

In [3]:
# instantiate some data
np.random.seed(1000)
auto = pd.read_csv('auto-mpg.csv')
tips = sns.load_dataset('tips')
small_quiz = pd.DataFrame({"students":["Eric R","Dolci","Jagandeep"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_grades = pd.DataFrame({"students":["Eric A","Eric R","Eryk W"],
                            "quiz_score":np.random.randint(0,10,3)})

In [4]:
conn = sqlite3.connect('lecture_code.db')
c = conn.cursor()

In [5]:
# insert these datasets into our db
#auto.to_sql('auto', con=conn)
tips.to_sql('tips', con=conn)
small_grades.to_sql('small_grade', con=conn)
small_quiz.to_sql('small_quiz',con=conn)

ValueError: Table 'tips' already exists.

In [ ]:
#get a list of all tables
query = """SELECT NAME FROM sqlite master where type = table order by name;"""
c.execute(query)
c.fetchall()

#### TIPS dataset

In [ ]:
# for the tips df/table, use PANDAS to get a count of a total of men and women
tips['sex'].value_counts()
tips.groupby(['sex']).siz()

In [ ]:
# translate this to sql 
query = """SELECT sex, COUNT(*) FROM tips GROUP BY sex;"""
c.execute(query).fetchall()

In [ ]:
# using PANDAS, select the average amount tipped for time(lunch and dinner)
tips.groupby(['time']).tip.mean()

In [17]:
# use sql to recreate this query
query = """SELECT time, AVG(tip) FROM tips GROUP BY time ORDER BY time DESC;"""
c.execute(query).fetchall()

[('Lunch', 2.7280882352941176), ('Dinner', 3.102670454545454)]

We can also use `GROUP BY` with certain conditions, in conjunction with filtering and ordering.

In [22]:
# use pandas, get the average total bills for a party larger than 2 for every size of party
tips.groupby(['size']).total_bill.mean()[2:]

size
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [26]:
# use sql to recreate this query hint: use having or where
query = """SELECT AVG(total_bill) FROM tips WHERE size > 2 GROUP BY size"""
c.execute(query).fetchall()

[(23.27763157894737,), (28.61351351351351,), (30.068,), (34.83,)]

In [ ]:
query =

c.execute(query).fetchall()

In [18]:
tips.groupby('day')['tip','total_bill'].mean().sort_values(by = 'tip', ascending = False)

/Users/dolcikey/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

           tip  total_bill
day
Sun   3.255132   21.410000
Sat   2.993103   20.441379
Thur  2.771452   17.682742
Fri   2.734737   17.151579

In [32]:
# exercise 1 - use pandas, get the maximum value of total bill for female non smoker
tips.groupby(['sex', 'smoker']).total_bill.max()['Female', 'No']

35.83

In [ ]:
tips[(tips.sex == 'Female')]

In [33]:
# use sql to recreate this query
query = """SELECT MAX(total_bill) FROM tips WHERE sex = 'Female' and smoker = 'No'"""
c.execute(query).fetchall()

[(35.83,)]

In [35]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [39]:
# exercise 2 - use PANDAS, the average amount of tips and tota bill for different day of the weak and sort by descending
# value of tip amount
tips.groupby(['day'])['tip', 'total_bill'].mean()

/Users/dolcikey/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

           tip  total_bill
day
Thur  2.771452   17.682742
Fri   2.734737   17.151579
Sat   2.993103   20.441379
Sun   3.255132   21.410000

In [17]:
# translate this to sql
query = """SELECT day, AVG(tip), AVG(total_bill) FROM tips GROUP BY day ORDER BY AVG(tip) DESC"""
c.execute(query).fetchall()

[('Sun', 3.255131578947369, 21.410000000000004),
 ('Sat', 2.993103448275862, 20.441379310344825),
 ('Thur', 2.771451612903226, 17.682741935483865),
 ('Fri', 2.734736842105263, 17.151578947368417)]

## Part II. Join

Based on this diagram, how would you explain the different types of joins?

<img src = 'sql-joins.png' width = 400>

In [3]:
print(small_grades)
print(small_quiz)

  students  quiz_score
0   Eric A           1
1   Eric R           0
2   Eryk W           9
    students  projects  grades
0     Eric R         1      99
1      Dolci         2      87
2  Jagandeep         1      80

In [ ]:
# left join - join small quiz with small grades, on student name
small_grades.merge(small_quiz, on = 'students', how = "left")

# if i run this command, what would happen? how many observations/record?

Syntax:


`SELECT * FROM left table JOIN right table ON left_table.key = right_table.key`

In [19]:
# sql 
query = """SELECT * FROM small_grade LEFT JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

[(0, 'Eric A', 1, None, None, None, None),
 (1, 'Eric R', 0, 0, 'Eric R', 1, 99),
 (2, 'Eryk W', 9, None, None, None, None)]

In [29]:
# investigate why we have more columns than pd results

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [24]:
column_name = [description[0] for description in c.description]
column_name

['index', 'students', 'quiz_score', 'index', 'students', 'projects', 'grades']

In [20]:
# inner join and get the student's grades
small_grades.merge(small_quiz, on = 'students', how = 'inner')

  students  quiz_score  projects  grades
0   Eric R           0         1      99

In [25]:
# SQL

query = """SELECT * from small_grade JOIN small_quiz USING(students)"""
c.execute(query).fetchall()

[(1, 'Eric R', 0, 0, 1, 99)]

### Level up 
1. Subqueries (including anti-joins)
2. Get median (using OFFSET)

In [34]:
# anti-join :get all the entries that are in the left table but not in the right table 
query = """SELECT students FROM small_grade WHERE students not in (SELECT students FROM small_quiz) """
c.execute(query).fetchall()

[('Eric A',), ('Eryk W',)]

In [27]:
# get median - use offset lets you skip over however many you specify 
query = """SELECT col FROM table ORDER BY col LIMIT 1 OFFSET (SELECT COUNT(*) FROM MyTable) / 2"""